Repository: wp-plugins/email-suscripcion
Catalog: lang/emailing-list-*.po
Languages: es_es

source: Subscribe
es_es: Suscribirse

source: E-mailing List
es_es: Lista de correos

source: Export to Excel
es_es: Exportar a Excel

source: email
es_es: Correo

source: Email Address
es_es: Ingrese su correo

source: Email address seems invalid.
es_es: Dirección de correo inválida

source: Your email was subscribed successfully.
es_es: Correo suscrito correctamente

source: Emailing Subscription
es_es: Suscripción a Emailing

source: A simple WordPress plugin for e-mailing subscription list.
es_es: Simple plugin para hacer suscripción a emailing

source: Show per page
es_es: Mostrar por página

source: All
es_es: Todos

source: Show
es_es: Mostrar

source: This Information is empty
es_es: Esta información está vacía
